doc/index.org
#+BIND: org-page-template "page_with_inline_sidebar.html"
#+BIND: org-page-toc-in-sidebar t
#+BIND: org-page-default-stylesheets t
#+TITLE: Exporting org-mode trees to HTML

* Introduction
This project provides a wrapper to simplify using [[https://orgmode.org/][org files]] as base for scripted publishing projects. Most of the implementation is in lisp, with a [[https://github.com/features/actions][GithHub action]] and a shell script wrapper provided.

Per default it supports page creation using [[https://github.com/juanjosegarciaripoll/org-thtml][org-thtml]] (as used for this page) or the default org-mode output ([[./plain/][this page with default renderer]]) - but can be customised to call arbitrary functions to handle the export. Tested copies of both org-thtml and [[https://github.com/hniksic/emacs-htmlize][htmlize]] are included in this repository, and will be automatically used by both script and action.

Very simple projects will be fine with some variables set in file headers, if at all. More complex projects may need to set some variables in [[*User setting files][user setting files]], while even more advanced ones will want to create custom lisp functions there.

* User setting files
The export script will try to load the file =export-settings.user= in a directory matching the project name, if available, and fall back to the project directory otherwise.

This file can contain arbitrary Emacs lisp, and gets loaded at the very end, i.e., can override or add to any variable or function definitions.

** Changing defaults for export modules
Each export module uses three levels of configuration:

- publish-org-tree defaults
- overwritten by settings used when adding the module
- overwritten by settings in <module>-export-plist

All [[https://orgmode.org/manual/Publishing-options.html][Org-mode publishing options]] are allowed. The format follows the [[https://orgmode.org/manual/Project-alist.html][org-publish-project-alist]] format to allow easy transformation of the different modules into a single org-publish-project-alist.

Project specific modules are best configured as described in the following section, while overrides for the default modules are best done using the 3rd override:

#+BEGIN_SRC
(setq html-export-plist '(:with-toc t))
#+END_SRC

This will enable TOC generation for the main HTML export module. Note that TOC generation is mainly useful when using the default org exporter - with org-thtml it is often easier to just call =org-html-toc= in a template. Also see the [[*org-page-toc-level][org-page-toc-level]] variable.

** Configuring additional export modules
The export script uses the list =dynamic-modules= for generated content, and the list =static-modules= for static content. Any additional modules pushed onto those list will be generated before the default modules - this is useful for generating files the main export pass expects to be present. The format follows the specification for

#+BEGIN_SRC lisp
(push `("sidebar"
        :publishing-directory ,abs-template-directory
        :base-directory ,(plist-get settings :project-directory)
        :exclude ,(regexp-opt '("index.org" "README.org"))
        :include ("sidebar.org")) dynamic-modules)

#+END_SRC

This example defines an export module called =sidebar=, excluding the files =index.org= and =README.org=, with the resulting html files generated in the absolute path to the [[*template_directory][template directory]] - which is the search path for org-thtmls :include macro.

#+BEGIN_SRC lisp
(push `("fontawesome"
        :publishing-directory ,(expand-file-name "fontawesome" (plist-get settings :publish-directory))
        :base-directory ,(expand-file-name "../fontawesome" (plist-get settings :project-directory)))
        static-modules)
#+END_SRC

This example pushes a local copy of [[https://fontawesome.com/][Font Awesome]] as static files to the subdirectory =fontawesome= in the [[*publish_directory][publish directory]].

