index.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content="Personal homepage exported with org-thtml">

  <title>Exporting org-mode trees to HTML</title>
  <meta property="og:url" content="http://nowhere.org/../index.html" />
  <meta property="og:title" content="Exporting org-mode trees to HTML" />
  <meta property="og:type" content="article" />
  <meta property="og:description" content="Personal homepage exported with org-thtml" />
  
    
    
<link rel="stylesheet" href="css/default.css" type="text/css"/>
<link rel="stylesheet" href="css/org.css" type="text/css"/>
<link rel="stylesheet" href="css/org-default.css" type="text/css"/>
<link rel="stylesheet" href="css/pure/pure-min.css" type="text/css"/>
<link rel="stylesheet" href="css/pure/grids-responsive-min.css" type="text/css"/>
<link rel="stylesheet" href="css/layouts/blog.css" type="text/css"/>


  </head>
  <body>
    <div id="layout" class="pure-g">
      <!-- sidebar contents -->
      <div class="sidebar pure-u-1 pure-u-md-1-3">


        <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6c55e59">Introduction</a></li>
<li><a href="#orgb64e375">User setting files</a>
<ul>
<li><a href="#org59185f6">Changing defaults for export modules</a></li>
<li><a href="#org66a2c0a">Configuring additional export modules</a></li>
</ul>
</li>
<li><a href="#org5f2d55d">Building locally</a></li>
<li><a href="#org5bce4f8">Using as github action</a></li>
<li><a href="#org93bd218">Customising output through org variables</a>
<ul>
<li><a href="#org7f21a63">org-page-template</a></li>
<li><a href="#org8d24d4b">org-page-toc-level</a></li>
<li><a href="#org1e477a8">org-page-toc-in-sidebar</a></li>
<li><a href="#orgfdad802">org-page-stylesheets</a></li>
<li><a href="#orga42b5b4">org-page-default-stylesheets</a></li>
<li><a href="#orgc7646cb">org-page-relative-stylesheets</a></li>
<li><a href="#org81883ef">org-page-absolute-stylesheets</a></li>
</ul>
</li>
<li><a href="#orgd2db2bf">Customising output with environment variables</a>
<ul>
<li><a href="#orgffe9d56">default_page_template</a></li>
<li><a href="#org7b8c263">org_publish_function</a></li>
<li><a href="#org231da79">project_directory</a></li>
<li><a href="#org543add5">project_name</a></li>
<li><a href="#orgbc672ff">publish_directory</a></li>
<li><a href="#orga9e2950">static_files</a></li>
<li><a href="#orga6b5b92">style_directory</a></li>
<li><a href="#org8ed7dad">template_directory</a></li>
</ul>
</li>
<li><a href="#org28a7219">Advanced use: Lisp in templates</a>
<ul>
<li><a href="#org2db34a5">add-stylesheets</a></li>
<li><a href="#orgf899b26">add-relative-stylesheets</a></li>
<li><a href="#org79318f7">insert-from-file</a></li>
</ul>
</li>
<li><a href="#org5f3d3ba">Configure github pages</a></li>
</ul>
</div>
</div>


        <div class="header">
        </div>
      </div>

      <div class="content pure-u-1 pure-u-md-2-3">
        <div class="pure-menu pure-menu-horizontal">
</div>


        <div id="content">
          
<div id="outline-container-org6c55e59" class="outline-2">
<h2 id="org6c55e59">Introduction</h2>
<div class="outline-text-2" id="text-org6c55e59">
<p>
This project provides a wrapper to simplify using <a href="https://orgmode.org/">org files</a> as base for scripted publishing projects. Most of the implementation is in lisp, with a <a href="https://github.com/features/actions">GithHub action</a> and a shell script wrapper provided.
</p>

<p>
Per default it supports page creation using <a href="https://github.com/juanjosegarciaripoll/org-thtml">org-thtml</a> (as used for this page) or the default org-mode output (<a href="./plain/">this page with default renderer</a>) - but can be customised to call arbitrary functions to handle the export. Tested copies of both org-thtml and <a href="https://github.com/hniksic/emacs-htmlize">htmlize</a> are included in this repository, and will be automatically used by both script and action.
</p>

<p>
Very simple projects will be fine with some variables set in file headers, if at all. More complex projects may need to set some variables in <a href="#orgb64e375">user setting files</a>, while even more advanced ones will want to create custom lisp functions there.
</p>
</div>
</div>

<div id="outline-container-orgb64e375" class="outline-2">
<h2 id="orgb64e375">User setting files</h2>
<div class="outline-text-2" id="text-orgb64e375">
<p>
The export script will try to load the file <code>export-settings.user</code> in a directory matching the project name, if available, and fall back to the project directory otherwise.
</p>

<p>
This file can contain arbitrary Emacs lisp, and gets loaded at the very end, i.e., can override or add to any variable or function definitions.
</p>
</div>

<div id="outline-container-org59185f6" class="outline-3">
<h3 id="org59185f6">Changing defaults for export modules</h3>
<div class="outline-text-3" id="text-org59185f6">
<p>
Each export module uses three levels of configuration:
</p>

<ul class="org-ul">
<li>publish-org-tree defaults</li>
<li>overwritten by settings used when adding the module</li>
<li>overwritten by settings in &lt;module&gt;-export-plist</li>
</ul>

<p>
All <a href="https://orgmode.org/manual/Publishing-options.html">Org-mode publishing options</a> are allowed. The format follows the <a href="https://orgmode.org/manual/Project-alist.html">org-publish-project-alist</a> format to allow easy transformation of the different modules into a single org-publish-project-alist.
</p>

<p>
Project specific modules are best configured as described in the following section, while overrides for the default modules are best done using the 3rd override:
</p>

<pre class="example">
(setq html-export-plist '(:with-toc t))
</pre>

<p>
This will enable TOC generation for the main HTML export module. Note that TOC generation is mainly useful when using the default org exporter - with org-thtml it is often easier to just call <code>org-html-toc</code> in a template. Also see the <a href="#org8d24d4b">org-page-toc-level</a> variable.
</p>
</div>
</div>

<div id="outline-container-org66a2c0a" class="outline-3">
<h3 id="org66a2c0a">Configuring additional export modules</h3>
<div class="outline-text-3" id="text-org66a2c0a">
<p>
The export script uses the list <code>dynamic-modules</code> for generated content, and the list <code>static-modules</code> for static content. Any additional modules pushed onto those list will be generated before the default modules - this is useful for generating files the main export pass expects to be present. The format follows the specification for
</p>

<div class="org-src-container">
<pre class="src src-lisp">(push `(<span class="org-string">"sidebar"</span>
        <span class="org-builtin">:publishing-directory</span> ,abs-template-directory
        <span class="org-builtin">:base-directory</span> ,(plist-get settings <span class="org-builtin">:project-directory</span>)
        <span class="org-builtin">:exclude</span> ,(regexp-opt '(<span class="org-string">"index.org"</span> <span class="org-string">"README.org"</span>))
        <span class="org-builtin">:include</span> (<span class="org-string">"sidebar.org"</span>)) <span class="org-warning">dynamic-modules)</span>

</pre>
</div>

<p>
This example defines an export module called <code>sidebar</code>, excluding the files <code>index.org</code> and <code>README.org</code>, with the resulting html files generated in the absolute path to the <a href="#org8ed7dad">template directory</a> - which is the search path for org-thtmls :include macro.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(push `(<span class="org-string">"fontawesome"</span>
        <span class="org-builtin">:publishing-directory</span> ,(expand-file-name <span class="org-string">"fontawesome"</span> (plist-get settings <span class="org-builtin">:publish-directory</span>))
        <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"../fontawesome"</span> (plist-get settings <span class="org-builtin">:project-directory</span>)))
        static-modules)
</pre>
</div>

<p>
This example pushes a local copy of <a href="https://fontawesome.com/">Font Awesome</a> as static files to the subdirectory <code>fontawesome</code> in the <a href="#orgbc672ff">publish directory</a>.
</p>
</div>
</div>
</div>
