doc/index.org
* Building locally
It is recommended to set up and test local builds first - once those are working transferring it to build on GitHub is trivial.

This section assumes the following local directory structure, with this repository checked out next to the directory containing the data for the published page:

#+BEGIN_EXAMPLE
/home/user/git/
|-- publish-org-tree
|   |-- doc
|   |   `-- index.org
|   |- action.yml
|   |- publish-org-tree.el
|   `- publish-org-tree.sh
|-- page
|   |-- style
|   |    `-- css
|   |-- templates
|   `-- doc
|       `-- index.org
#+END_EXAMPLE

The shell should be in the =page= directory, calling the =publish-org-tree.sh= script with a relative path:

#+BEGIN_SRC shell
~/page/> ../publish-org-tree/publish-org-tree.sh
Loading /home/user/git/publish-org-tree/publish-org-tree.el (source)...
Loading /home/user/git/publish-org-tree/ox-thtml.el (source)...
Package cl is deprecated
,*** Configuration summary ***

Configuration variables (defaults marked with *):

,*default-page-template: page.html
,*org-publish-function: org-html-publish-to-html
,*project-directory: .
,*project-name: default
,*publish-directory:
,*static-files: (css eot gif jpg js json less mp3 ogg pdf png scss svg ttf txt woff woff2 yml zip)
,*style-directory:
,*template-directory:

Publishing project ’default’ to
Elements in export alist:
- default
- default-static
- default-html
Loading /home/user/.org-timestamps/default-static.cache...
Publishing file /home/user/git/page/style/css/default.css using ‘org-publish-attachment’
Resetting org-publish-cache
Loading /home/user/.org-timestamps/default-html.cache...
Publishing file /home/user/git/page/doc/index.org using ‘org-html-publish-to-html’
#+END_SRC

This will have generated =doc/index.html= - nice, but not quite ideal. By setting the [[*publish_directory][publish_directory]] variable the output directory can be controlled:

#+BEGIN_SRC shell
~/page/> publish_directory=/tmp/org-publish ../publish-org-tree/publish-org-tree.sh
Loading /home/user/git/publish-org-tree/publish-org-tree.el (source)...
Loading /home/user/git/publish-org-tree/ox-thtml.el (source)...
Package cl is deprecated
,*** Configuration summary ***

Configuration variables (defaults marked with *):

,*default-page-template: page.html
,*org-publish-function: org-html-publish-to-html
,*project-directory: .
,*project-name: default
publish-directory: /tmp/org-publish
,*static-files: (css eot gif jpg js json less mp3 ogg pdf png scss svg ttf txt woff woff2 yml zip)
,*style-directory:
,*template-directory:

Publishing project ’default’ to /tmp/org-publish
Elements in export alist:
- default
- default-static
- default-html
Loading /home/user/.org-timestamps/default-static.cache...
Publishing file /home/user/git/page/style/css/default.css using ‘org-publish-attachment’
Resetting org-publish-cache
Loading /home/user/.org-timestamps/default-html.cache...
Publishing file /home/user/git/page/doc/index.org using ‘org-html-publish-to-html’
#+END_SRC

Note that the output shows that =publish-directory= has been changed from the default value.

Now =/tmp/org-publish= exists - but the =index.html= is still in the doc subdirectory. It can be moved to the root of the publish directory by setting the [[*project_directory][project_directory]] variable to =doc=:

#+BEGIN_SRC shell
~/page/> project_directory=doc publish_directory=/tmp/org-publish ../publish-org-tree/publish-org-tree.sh
[..]
Loading /home/user/.org-timestamps/default-static.cache...
Resetting org-publish-cache
Loading /home/user/.org-timestamps/default-html.cache...
Publishing file /home/user/git/page/doc/index.org using ‘org-html-publish-to-html’
#+END_SRC

=index.html= is directly in =/tmp/org-publish= - but now the CSS is missing. The easiest way to keep CSS files separate from the rest of the page is by setting the [[*style_directory][style_directory]] variable:

#+BEGIN_SRC shell
~/page/> style_directory=../style project_directory=doc publish_directory=/tmp/org-publish ../publish-org-tree/publish-org-tree.sh
[..]
Elements in export alist:
- default
- default-style
- default-static
- default-html
Loading /home/user/.org-timestamps/default-style.cache...
Publishing file /home/user/git/page/style/css/default.css using ‘org-publish-attachment’
Resetting org-publish-cache
Loading /home/user/.org-timestamps/default-static.cache...
Resetting org-publish-cache
Loading /home/user/.org-timestamps/default-html.cache...
Publishing file /home/user/git/page/doc/index.org using ‘org-html-publish-to-html’
#+END_SRC

Now =style/css= gets published to =/tmp/org-publish/css= in the additional =style= module.

* Using as github action
Assuming the local configuration works the parameters can be easily applied to the github action. All [[*Customising output with environment variables][environment variables]] can be set as environment for the action - but =publish-directory= is available is input to the action with a default more sensible for use in the action (=/tmp/publish-org-tree=):

#+BEGIN_SRC
    - name: Build page
      uses: aardsoft/publish-org-tree@v1
      env:
        project_directory: doc
        style_directory: ../style
#+END_SRC

After [[*Configure github pages][preparing the repository for github pages]] this action can also directly push the generated page to github pages:

#+BEGIN_SRC
    - name: Build page
      uses: aardsoft/publish-org-tree@v1
      with:
        gh-pages: true
      env:
        project_directory: doc
        style_directory: ../style
        GH_TOKEN: ${{secrets.GITHUB_TOKEN}}
#+END_SRC

Available inputs to control GitHub pages publishing are:

- gh-pages, assumed =True= when set to any value
- gh-pages-branch, the branch published pages should be pushed to. Default is =gh-pages=.
- gh-pages-directory, the directory in the branch pages should be pushed to. Default is =.=, i.e., the root of the directory tree.

* Customising output through org variables
Some output options can be set per file by binding specific variables in the file header, in addition to the [[https://orgmode.org/manual/Export-Settings.html][usual org-mode export settings.]] Note that all variables listed here can also be set as [[*User setting files][user settings]] as global settings for a project.

#+BEGIN_SRC org
#+BIND: org-page-template "page_with_inline_sidebar.html"
#+BIND: org-page-toc-in-sidebar t
#+END_SRC

Arbitrary variables can be used with org-thtml - but as the templates get compiled they need to be defined: =(defvar org-page-my-custom-variable nil)=. To avoid having to add [[*User setting files][user settings]] for common variables some variables only useful inside of templates are also pre-defined.

** org-page-template
Override the page template to use when exporting this page.

** org-page-toc-level
Set the depth of the TOC included in some templates. Default is =3=.

Note that this needs to be supported in the templates - the relevant templates needs to contain something like this:

#+BEGIN_SRC lisp
{{(org-html-toc org-page-toc-level info)}}
#+END_SRC

