index.html

<div id="outline-container-org5f2d55d" class="outline-2">
<h2 id="org5f2d55d">Building locally</h2>
<div class="outline-text-2" id="text-org5f2d55d">
<p>
It is recommended to set up and test local builds first - once those are working transferring it to build on GitHub is trivial.
</p>

<p>
This section assumes the following local directory structure, with this repository checked out next to the directory containing the data for the published page:
</p>

<pre class="example">
/home/user/git/
|-- publish-org-tree
|   |-- doc
|   |   `-- index.org
|   |- action.yml
|   |- publish-org-tree.el
|   `- publish-org-tree.sh
|-- page
|   |-- style
|   |    `-- css
|   |-- templates
|   `-- doc
|       `-- index.org
</pre>

<p>
The shell should be in the <code>page</code> directory, calling the <code>publish-org-tree.sh</code> script with a relative path:
</p>

<div class="org-src-container">
<pre class="src src-shell">~/page/&gt; ../publish-org-tree/publish-org-tree.sh
Loading /home/user/git/publish-org-tree/publish-org-tree.el (source)...
Loading /home/user/git/publish-org-tree/ox-thtml.el (source)...
Package cl is deprecated
*** Configuration summary ***

Configuration variables (defaults marked with *):

*default-page-template: page.html
*org-publish-function: org-html-publish-to-html
*project-directory: .
*project-name: default
*publish-directory:
*static-files: (css eot gif jpg js json less mp3 ogg pdf png scss svg ttf txt woff woff2 yml zip)
*style-directory:
*template-directory:

Publishing project &#8217;default&#8217; to
Elements<span class="org-keyword"> in</span> export alist:
- default
- default-static
- default-html
Loading /home/user/.org-timestamps/default-static.cache...
Publishing file /home/user/git/page/style/css/default.css using &#8216;org-publish-attachment&#8217;
Resetting org-publish-cache
Loading /home/user/.org-timestamps/default-html.cache...
Publishing file /home/user/git/page/doc/index.org using &#8216;org-html-publish-to-html&#8217;
</pre>
</div>

<p>
This will have generated <code>doc/index.html</code> - nice, but not quite ideal. By setting the <a href="#orgbc672ff">publish_directory</a> variable the output directory can be controlled:
</p>

<div class="org-src-container">
<pre class="src src-shell">~/page/&gt; <span class="org-variable-name">publish_directory</span>=/tmp/org-publish ../publish-org-tree/publish-org-tree.sh
Loading /home/user/git/publish-org-tree/publish-org-tree.el (source)...
Loading /home/user/git/publish-org-tree/ox-thtml.el (source)...
Package cl is deprecated
*** Configuration summary ***

Configuration variables (defaults marked with *):

*default-page-template: page.html
*org-publish-function: org-html-publish-to-html
*project-directory: .
*project-name: default
publish-directory: /tmp/org-publish
*static-files: (css eot gif jpg js json less mp3 ogg pdf png scss svg ttf txt woff woff2 yml zip)
*style-directory:
*template-directory:

Publishing project &#8217;default&#8217; to /tmp/org-publish
Elements<span class="org-keyword"> in</span> export alist:
- default
- default-static
- default-html
Loading /home/user/.org-timestamps/default-static.cache...
Publishing file /home/user/git/page/style/css/default.css using &#8216;org-publish-attachment&#8217;
Resetting org-publish-cache
Loading /home/user/.org-timestamps/default-html.cache...
Publishing file /home/user/git/page/doc/index.org using &#8216;org-html-publish-to-html&#8217;
</pre>
</div>

<p>
Note that the output shows that <code>publish-directory</code> has been changed from the default value.
</p>

<p>
Now <code>/tmp/org-publish</code> exists - but the <code>index.html</code> is still in the doc subdirectory. It can be moved to the root of the publish directory by setting the <a href="#org231da79">project_directory</a> variable to <code>doc</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell">~/page/&gt; <span class="org-variable-name">project_directory</span>=doc <span class="org-variable-name">publish_directory</span>=/tmp/org-publish ../publish-org-tree/publish-org-tree.sh
[..]
Loading /home/user/.org-timestamps/default-static.cache...
Resetting org-publish-cache
Loading /home/user/.org-timestamps/default-html.cache...
Publishing file /home/user/git/page/doc/index.org using &#8216;org-html-publish-to-html&#8217;
</pre>
</div>

<p>
<code>index.html</code> is directly in <code>/tmp/org-publish</code> - but now the CSS is missing. The easiest way to keep CSS files separate from the rest of the page is by setting the <a href="#orga6b5b92">style_directory</a> variable:
</p>

<div class="org-src-container">
<pre class="src src-shell">~/page/&gt; <span class="org-variable-name">style_directory</span>=../style <span class="org-variable-name">project_directory</span>=doc <span class="org-variable-name">publish_directory</span>=/tmp/org-publish ../publish-org-tree/publish-org-tree.sh
[..]
Elements<span class="org-keyword"> in</span> export alist:
- default
- default-style
- default-static
- default-html
Loading /home/user/.org-timestamps/default-style.cache...
Publishing file /home/user/git/page/style/css/default.css using &#8216;org-publish-attachment&#8217;
Resetting org-publish-cache
Loading /home/user/.org-timestamps/default-static.cache...
Resetting org-publish-cache
Loading /home/user/.org-timestamps/default-html.cache...
Publishing file /home/user/git/page/doc/index.org using &#8216;org-html-publish-to-html&#8217;
</pre>
</div>

<p>
Now <code>style/css</code> gets published to <code>/tmp/org-publish/css</code> in the additional <code>style</code> module.
</p>
</div>
</div>

<div id="outline-container-org5bce4f8" class="outline-2">
<h2 id="org5bce4f8">Using as github action</h2>
<div class="outline-text-2" id="text-org5bce4f8">
<p>
Assuming the local configuration works the parameters can be easily applied to the github action. All <a href="#orgd2db2bf">environment variables</a> can be set as environment for the action - but <code>publish-directory</code> is available is input to the action with a default more sensible for use in the action (<code>/tmp/publish-org-tree</code>):
</p>

<pre class="example">
- name: Build page
  uses: aardsoft/publish-org-tree@v1
  env:
    project_directory: doc
    style_directory: ../style
</pre>

<p>
After <a href="#org5f3d3ba">preparing the repository for github pages</a> this action can also directly push the generated page to github pages:
</p>

<pre class="example">
- name: Build page
  uses: aardsoft/publish-org-tree@v1
  with:
    gh-pages: true
  env:
    project_directory: doc
    style_directory: ../style
    GH_TOKEN: ${{secrets.GITHUB_TOKEN}}
</pre>

<p>
Available inputs to control GitHub pages publishing are:
</p>

<ul class="org-ul">
<li>gh-pages, assumed <code>True</code> when set to any value</li>
<li>gh-pages-branch, the branch published pages should be pushed to. Default is <code>gh-pages</code>.</li>
<li>gh-pages-directory, the directory in the branch pages should be pushed to. Default is <code>.</code>, i.e., the root of the directory tree.</li>
</ul>
</div>
</div>

<div id="outline-container-org93bd218" class="outline-2">
<h2 id="org93bd218">Customising output through org variables</h2>
<div class="outline-text-2" id="text-org93bd218">
<p>
Some output options can be set per file by binding specific variables in the file header, in addition to the <a href="https://orgmode.org/manual/Export-Settings.html">usual org-mode export settings.</a> Note that all variables listed here can also be set as <a href="#orgb64e375">user settings</a> as global settings for a project.
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+BIND: org-page-template "page_with_inline_sidebar.html"</span>
<span class="org-org-meta-line">#+BIND: org-page-toc-in-sidebar t</span>
</pre>
</div>

<p>
Arbitrary variables can be used with org-thtml - but as the templates get compiled they need to be defined: <code>(defvar org-page-my-custom-variable nil)</code>. To avoid having to add <a href="#orgb64e375">user settings</a> for common variables some variables only useful inside of templates are also pre-defined.
</p>
</div>

<div id="outline-container-org7f21a63" class="outline-3">
<h3 id="org7f21a63">org-page-template</h3>
<div class="outline-text-3" id="text-org7f21a63">
<p>
Override the page template to use when exporting this page.
</p>
</div>
</div>

<div id="outline-container-org8d24d4b" class="outline-3">
<h3 id="org8d24d4b">org-page-toc-level</h3>
<div class="outline-text-3" id="text-org8d24d4b">
<p>
Set the depth of the TOC included in some templates. Default is <code>3</code>.
</p>

<p>
Note that this needs to be supported in the templates - the relevant templates needs to contain something like this:
</p>

<div class="org-src-container">
<pre class="src src-lisp">{{(org-html-toc org-page-toc-level info)}}
</pre>
</div>
</div>
</div>
