doc/index.org
** org-page-toc-in-sidebar
Include a TOC in templates with inline sidebar. Default is =t=.

Note that this needs to be supported in the templates - the relevant templates needs to contain something like this:

#+BEGIN_SRC lisp
{{(if org-page-toc-in-sidebar (org-html-toc org-page-toc-level info))}}
#+END_SRC

** org-page-stylesheets
A list of stylesheets to add to the page. If the path is absolute it will be transformed to a path relative to the project directory. The default value is ='()=.

#+BEGIN_SRC org
#+BIND: org-page-stylesheets ("/css/default.css" "/css/pure/pure-min.css")
#+END_SRC

Note that this needs to be configured in the templates - see [[*add-relative-stylesheets][add-relative-stylesheets]] for details.

** org-page-default-stylesheets
Use a list of default stylesheets. The default value is =nil=. This is just a flag for guarding an implementation which needs to be either provided in a customisation file or a template. A possible way to do it in a template is:

#+BEGIN_SRC lisp
    {{
(progn
  (if (and (= (length org-page-stylesheets) 0) org-page-default-stylesheets)
      (setq org-page-stylesheets '("/css/default.css"
                                   "/css/pure/pure-min.css"
                                   "/css/pure/grids-responsive-min.css"
                                   "/css/layouts/blog.css")))
    "")
    }}
#+END_SRC

Note the =""= at the end - the template engine experts strings, so to execute arbitrary code without changing the output the last argument must be an empty string.

** org-page-relative-stylesheets
A list of stylesheets to add to a page with relative paths. Can be used as alternative to [[*org-page-stylesheets][org-page-stylesheets]] with a more descriptive name.

** org-page-absolute-stylesheets
A list of stylesheets to add to the path with absolute paths. The variable content will not be modified, and should already be absolute paths to the stylesheet locations on a server or filesystem.

* Customising output with environment variables
Some aspects of the export script can be controlled via environment variables, some of which are exported as action parameters. This section documents a complete list of available variables.

** default_page_template
The default template to use if no other template is specified.. Defaults to =page.html=.

** org_publish_function
The function to call for doing the export. Defaults to =org-html-publish-to-html=. For using org-thtml set this to =org-html-publish-to-templated-html=, look at the [[https://github.com/juanjosegarciaripoll/org-thtml/tree/master/personal-site/templates][org-thtml example templates]], generade a [[*template_directory][template directory]], and maybe read the [[*Advanced use: Lisp in templates][advanced templating section]].

** project_directory
The main directory to export. Defaults to =.=, which often is not what you want.

** project_name
The name of the project. This is mostly used internally, so leaving the default of =default= is fine in most cases.

** publish_directory
The directory to publish the generated files to. Defaults to "" when used directly, which usually is not what you want.

** static_files
A list of patterns for matching static files to export. Defaults to =css eot gif jpg js json less mp3 ogg pdf png scss svg ttf txt woff woff2 yml zip=.

** style_directory
A directory containing style sheets and similar files. The default is =""= (empty). When not empty this is treated as an additional static module.

Note that the directory name is relative to the project directory. Assuming the following directory structure with the scripts executed in the =page= directory and the project set to =doc= the correct value for =style_directory= is =../style=

#+BEGIN_EXAMPLE
/home/user/page/
|-- style
|   `-- css
|   `-- templates
`-- doc
#+END_EXAMPLE

** template_directory
A directory containing template files. Setting this usually is only sensible when using =org-html-publish-to-templated-html= as [[*org_publish_function][org_publish_function]].

Just like [[*style_directory][style_directory]] this is relative to the [[*project_directory][project directory]].

#+BEGIN_SRC yaml
- name: Build page
  uses: aardsoft/publish-org-tree@v1
  with:
    project-directory: doc
    gh-pages: true
  env:
    GH_TOKEN: ${{secrets.GITHUB_TOKEN}}
    pre_excludes: .
#+END_SRC

* Advanced use: Lisp in templates
=publish-org-tree.el= defines some helper function useful when using templates. This section documents those helper functions.

** add-stylesheets
This function takes a list of stylesheet files, and generates the matching link statements without altering the path names.

It can be used in a template as follows:

#+BEGIN_SRC lisp
{{(if (> (length org-page-absolute-stylesheets) 0)(add-stylesheets org-page-absolute-stylesheets info))}}
#+END_SRC

** add-relative-stylesheets
This function takes a list of stylesheets (see [[*org-page-stylesheets][org-page-stylesheets]] and [[*org-page-default-stylesheets][org-page-default-stylesheets]]), and generates path names relative to the project directory. This enables easy publishing of self-contained pages where CSS can be found by the browser both locally and when published to a web server.

With =org-page-stylesheets= set either through a [[*User setting files][user setting file]], in a template or in the org header the following org-thtml snippet will include the correct stylesheets:

#+BEGIN_SRC lisp
{{(if (> (length org-page-stylesheets) 0)(add-relative-stylesheets org-page-stylesheets info))}}
#+END_SRC

** insert-from-file
Insert the contents of a file without performing macro expansion:

#+BEGIN_SRC lisp
{{(insert-from-file "custom-insert.html")}}
#+END_SRC

The function takes a list of directories to search for the file as optional second argument. If omitted the file is searched in the project directory, followed by the template directory.

