index.html

<div id="outline-container-org1e477a8" class="outline-3">
<h3 id="org1e477a8">org-page-toc-in-sidebar</h3>
<div class="outline-text-3" id="text-org1e477a8">
<p>
Include a TOC in templates with inline sidebar. Default is <code>t</code>.
</p>

<p>
Note that this needs to be supported in the templates - the relevant templates needs to contain something like this:
</p>

<div class="org-src-container">
<pre class="src src-lisp">{{(<span class="org-keyword">if</span> org-page-toc-in-sidebar (org-html-toc org-page-toc-level info))}}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfdad802" class="outline-3">
<h3 id="orgfdad802">org-page-stylesheets</h3>
<div class="outline-text-3" id="text-orgfdad802">
<p>
A list of stylesheets to add to the page. If the path is absolute it will be transformed to a path relative to the project directory. The default value is <code>'()</code>.
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+BIND: org-page-stylesheets ("/css/default.css" "/css/pure/pure-min.css")</span>
</pre>
</div>

<p>
Note that this needs to be configured in the templates - see <a href="#orgf899b26">add-relative-stylesheets</a> for details.
</p>
</div>
</div>

<div id="outline-container-orga42b5b4" class="outline-3">
<h3 id="orga42b5b4">org-page-default-stylesheets</h3>
<div class="outline-text-3" id="text-orga42b5b4">
<p>
Use a list of default stylesheets. The default value is <code>nil</code>. This is just a flag for guarding an implementation which needs to be either provided in a customisation file or a template. A possible way to do it in a template is:
</p>

<div class="org-src-container">
<pre class="src src-lisp">    {{
(<span class="org-keyword">progn</span>
  (<span class="org-keyword">if</span> (and (= (length org-page-stylesheets) 0) org-page-default-stylesheets)
      (setq org-page-stylesheets '(<span class="org-string">"/css/default.css"</span>
                                   <span class="org-string">"/css/pure/pure-min.css"</span>
                                   <span class="org-string">"/css/pure/grids-responsive-min.css"</span>
                                   <span class="org-string">"/css/layouts/blog.css"</span>)))
    <span class="org-string">""</span>)
    }}
</pre>
</div>

<p>
Note the <code>""</code> at the end - the template engine experts strings, so to execute arbitrary code without changing the output the last argument must be an empty string.
</p>
</div>
</div>

<div id="outline-container-orgc7646cb" class="outline-3">
<h3 id="orgc7646cb">org-page-relative-stylesheets</h3>
<div class="outline-text-3" id="text-orgc7646cb">
<p>
A list of stylesheets to add to a page with relative paths. Can be used as alternative to <a href="#orgfdad802">org-page-stylesheets</a> with a more descriptive name.
</p>
</div>
</div>

<div id="outline-container-org81883ef" class="outline-3">
<h3 id="org81883ef">org-page-absolute-stylesheets</h3>
<div class="outline-text-3" id="text-org81883ef">
<p>
A list of stylesheets to add to the path with absolute paths. The variable content will not be modified, and should already be absolute paths to the stylesheet locations on a server or filesystem.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd2db2bf" class="outline-2">
<h2 id="orgd2db2bf">Customising output with environment variables</h2>
<div class="outline-text-2" id="text-orgd2db2bf">
<p>
Some aspects of the export script can be controlled via environment variables, some of which are exported as action parameters. This section documents a complete list of available variables.
</p>
</div>

<div id="outline-container-orgffe9d56" class="outline-3">
<h3 id="orgffe9d56">default_page_template</h3>
<div class="outline-text-3" id="text-orgffe9d56">
<p>
The default template to use if no other template is specified.. Defaults to <code>page.html</code>.
</p>
</div>
</div>

<div id="outline-container-org7b8c263" class="outline-3">
<h3 id="org7b8c263">org_publish_function</h3>
<div class="outline-text-3" id="text-org7b8c263">
<p>
The function to call for doing the export. Defaults to <code>org-html-publish-to-html</code>. For using org-thtml set this to <code>org-html-publish-to-templated-html</code>, look at the <a href="https://github.com/juanjosegarciaripoll/org-thtml/tree/master/personal-site/templates">org-thtml example templates</a>, generade a <a href="#org8ed7dad">template directory</a>, and maybe read the <a href="#org28a7219">advanced templating section</a>.
</p>
</div>
</div>

<div id="outline-container-org231da79" class="outline-3">
<h3 id="org231da79">project_directory</h3>
<div class="outline-text-3" id="text-org231da79">
<p>
The main directory to export. Defaults to <code>.</code>, which often is not what you want.
</p>
</div>
</div>

<div id="outline-container-org543add5" class="outline-3">
<h3 id="org543add5">project_name</h3>
<div class="outline-text-3" id="text-org543add5">
<p>
The name of the project. This is mostly used internally, so leaving the default of <code>default</code> is fine in most cases.
</p>
</div>
</div>

<div id="outline-container-orgbc672ff" class="outline-3">
<h3 id="orgbc672ff">publish_directory</h3>
<div class="outline-text-3" id="text-orgbc672ff">
<p>
The directory to publish the generated files to. Defaults to "" when used directly, which usually is not what you want.
</p>
</div>
</div>

<div id="outline-container-orga9e2950" class="outline-3">
<h3 id="orga9e2950">static_files</h3>
<div class="outline-text-3" id="text-orga9e2950">
<p>
A list of patterns for matching static files to export. Defaults to <code>css eot gif jpg js json less mp3 ogg pdf png scss svg ttf txt woff woff2 yml zip</code>.
</p>
</div>
</div>

<div id="outline-container-orga6b5b92" class="outline-3">
<h3 id="orga6b5b92">style_directory</h3>
<div class="outline-text-3" id="text-orga6b5b92">
<p>
A directory containing style sheets and similar files. The default is <code>""</code> (empty). When not empty this is treated as an additional static module.
</p>

<p>
Note that the directory name is relative to the project directory. Assuming the following directory structure with the scripts executed in the <code>page</code> directory and the project set to <code>doc</code> the correct value for <code>style_directory</code> is <code>../style</code>
</p>

<pre class="example">
/home/user/page/
|-- style
|   `-- css
|   `-- templates
`-- doc
</pre>
</div>
</div>

<div id="outline-container-org8ed7dad" class="outline-3">
<h3 id="org8ed7dad">template_directory</h3>
<div class="outline-text-3" id="text-org8ed7dad">
<p>
A directory containing template files. Setting this usually is only sensible when using <code>org-html-publish-to-templated-html</code> as <a href="#org7b8c263">org_publish_function</a>.
</p>

<p>
Just like <a href="#orga6b5b92">style_directory</a> this is relative to the <a href="#org231da79">project directory</a>.
</p>

<div class="org-src-container">
<pre class="src src-yaml">- name: Build page
  uses: aardsoft/publish-org-tree@v1
  with:
    project-directory: doc
    gh-pages: true
  env:
    GH_TOKEN: ${{secrets.GITHUB_TOKEN}}
    pre_excludes: .
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org28a7219" class="outline-2">
<h2 id="org28a7219">Advanced use: Lisp in templates</h2>
<div class="outline-text-2" id="text-org28a7219">
<p>
<code>publish-org-tree.el</code> defines some helper function useful when using templates. This section documents those helper functions.
</p>
</div>

<div id="outline-container-org2db34a5" class="outline-3">
<h3 id="org2db34a5">add-stylesheets</h3>
<div class="outline-text-3" id="text-org2db34a5">
<p>
This function takes a list of stylesheet files, and generates the matching link statements without altering the path names.
</p>

<p>
It can be used in a template as follows:
</p>

<div class="org-src-container">
<pre class="src src-lisp">{{(<span class="org-keyword">if</span> (&gt; (length org-page-absolute-stylesheets) 0)(add-stylesheets org-page-absolute-stylesheets info))}}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf899b26" class="outline-3">
<h3 id="orgf899b26">add-relative-stylesheets</h3>
<div class="outline-text-3" id="text-orgf899b26">
<p>
This function takes a list of stylesheets (see <a href="#orgfdad802">org-page-stylesheets</a> and <a href="#orga42b5b4">org-page-default-stylesheets</a>), and generates path names relative to the project directory. This enables easy publishing of self-contained pages where CSS can be found by the browser both locally and when published to a web server.
</p>

<p>
With <code>org-page-stylesheets</code> set either through a <a href="#orgb64e375">user setting file</a>, in a template or in the org header the following org-thtml snippet will include the correct stylesheets:
</p>

<div class="org-src-container">
<pre class="src src-lisp">{{(<span class="org-keyword">if</span> (&gt; (length org-page-stylesheets) 0)(add-relative-stylesheets org-page-stylesheets info))}}
</pre>
</div>
</div>
</div>

<div id="outline-container-org79318f7" class="outline-3">
<h3 id="org79318f7">insert-from-file</h3>
<div class="outline-text-3" id="text-org79318f7">
<p>
Insert the contents of a file without performing macro expansion:
</p>

<div class="org-src-container">
<pre class="src src-lisp">{{(insert-from-file <span class="org-string">"custom-insert.html"</span>)}}
</pre>
</div>

<p>
The function takes a list of directories to search for the file as optional second argument. If omitted the file is searched in the project directory, followed by the template directory.
</p>
</div>
</div>
</div>
