index.html

<div id="outline-container-org5f3d3ba" class="outline-2">
<h2 id="org5f3d3ba">Configure github pages</h2>
<div class="outline-text-2" id="text-org5f3d3ba">
<p>
This action can directly publish to <a href="https://pages.github.com/">github pages</a>. To use this first a branch for pages needs to be created. The following creates a branch with an empty index.html:
</p>

<div class="org-src-container">
<pre class="src src-bash">:@dev; git checkout --orphan gh-pages
:@dev; git rm -rf .
:@dev; touch index.html
:@dev; git add index.html
:@dev; git commit -m <span class="org-string">'Initialize gh-pages branch'</span>
:@dev; git push origin gh-pages
:@dev; git checkout master
</pre>
</div>

<p>
Next the <code>gh-pages</code> parameter needs to be added to this action. Note that any value here is read as <code>True</code>:
</p>

<div class="org-src-container">
<pre class="src src-yaml">- name: Build page
  uses: aardsoft/publish-org-tree@v1
  with:
    project-directory: doc
    gh-pages: true
  env:
    GH_TOKEN: ${{secrets.GITHUB_TOKEN}}
</pre>
</div>

<p>
The <code>GH_TOKEN</code> variable with the github secret is required for pushing to the branch.
</p>
</div>
</div>

        </div>

        <div class="footer">
</div>

      </div>
    </div>
  </body>
</html>
